10_Forms/starter_code/ShirtsApp/app/controllers/shirts_controller.rb

SELECT "shirts".* FROM "shirts" WHERE (name LIKE '%%' OR description LIKE '%%')
---
  def index
    @shirts = Shirt.all()