10_Forms/starter_code/ShirtsApp/app/controllers/shirts_controller.rb

  def new
    @shirt = Shirt.new()  #
    @shirts = Shirt.all()
---
SELECT "shirts".* FROM "shirts"