12_Associations/starter_code/Rewsly_Associations/app/views/stories/_story.html.erb

  Categories:
<% story.categories.each do |category| %>
---
SELECT "categories".* FROM "categories" INNER JOIN "categories_stories" ON "categories"."id" = "categories_stories"."category_id" WHERE "categories_stories"."story_id" = ?  [["story_id", 1]]