12_Associations/starter_code/Rewsly_Associations/app/controllers/stories_controller.rb

  def index
    @stories = params[:q] ? Story.search_for(params[:q]) : Story.all
---
SELECT "stories".* FROM "stories" WHERE (title LIKE '%stuff%' OR category LIKE '%stuff%')