10_Forms/starter_code/MovieApp/app/controllers/movies_controller.rb

  def index
    @movies = Movie.all()
---
SELECT "movies".* FROM "movies"