10_Forms/starter_code/MovieApp/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (title LIKE '%it%' OR description LIKE '%it%')
---
  def load_movie ()
    @movie = Movie.find(params[:id])