11_Forms_Associations/starter_code/ShirtsApp/app/controllers/shirts_controller.rb

  def create
    @shirt = Shirt.new(safe_shirt_params)
    if @shirt.save()
---
INSERT INTO "shirts" ("created_at", "description", "image", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Fri, 08 Jan 2016 02:55:40 UTC +00:00], ["description", "thingssdfsdfd"], ["image", "who.png"], ["name", "things"], ["updated_at", Fri, 08 Jan 2016 02:55:40 UTC +00:00]]

  def update
    if @shirt.update(safe_shirt_params)
---
UPDATE "shirts" SET "name" = ?, "updated_at" = ? WHERE "shirts"."id" = 1  [["name", "thingsdddd"], ["updated_at", Fri, 08 Jan 2016 03:16:13 UTC +00:00]]

  def load_shirt
    @shirt = Shirt.find(params[:id])
---
SELECT "shirts".* FROM "shirts" WHERE (name LIKE '%%' OR description LIKE '%%')